Used GPU: True
where_clause:"WHERE (r.recording_id > 1)"
limit_clause:"ORDER BY RAND(1)"
epochs: 1000
batch_size: 24
max_accuracy: 0.90

    _________________________________________________________________
    Layer (type)                 Output Shape              Param #   
    =================================================================
    conv2d_1 (Conv2D)            (None, 478, 638, 32)      896       
    _________________________________________________________________
    max_pooling2d_1 (MaxPooling2 (None, 239, 319, 32)      0         
    _________________________________________________________________
    dropout_1 (Dropout)          (None, 239, 319, 32)      0         
    _________________________________________________________________
    conv2d_2 (Conv2D)            (None, 237, 317, 64)      18496     
    _________________________________________________________________
    max_pooling2d_2 (MaxPooling2 (None, 118, 158, 64)      0         
    _________________________________________________________________
    dropout_2 (Dropout)          (None, 118, 158, 64)      0         
    _________________________________________________________________
    conv2d_3 (Conv2D)            (None, 116, 156, 128)     73856     
    _________________________________________________________________
    max_pooling2d_3 (MaxPooling2 (None, 58, 78, 128)       0         
    _________________________________________________________________
    dropout_3 (Dropout)          (None, 58, 78, 128)       0         
    _________________________________________________________________
    flatten_1 (Flatten)          (None, 579072)            0         
    _________________________________________________________________
    dense_1 (Dense)              (None, 256)               148242688 
    _________________________________________________________________
    dropout_4 (Dropout)          (None, 256)               0         
    _________________________________________________________________
    dense_2 (Dense)              (None, 1)                 257       
    =================================================================
    Total params: 148,336,193
    Trainable params: 148,336,193
    Non-trainable params: 0
    _________________________________________________________________

Across all folds:
Average accuracy: 0.677177177 Stddev: 0.331603066
Average loss: 0.244254725 Stddev: 0.038277579
           E0     E1
    P0   8702   3286 
    P1      0      0



Fold, Accuracy, Loss, TN, FN, FP, TP, Stop Reason
2,0.8768768768768769,0.20909421265244604,876.0,123.0,0.0,0.0,Training stopped progressing
3,0.6226226226226226,0.23757661883537476,622.0,377.0,0.0,0.0,Training stopped progressing
4,0.5795795795795796,0.2511788159235939,579.0,420.0,0.0,0.0,Training stopped progressing
5,0.7587587587587588,0.19777599372364976,758.0,241.0,0.0,0.0,Training stopped progressing
6,0.8088088088088088,0.1838658293028613,808.0,191.0,0.0,0.0,Training stopped progressing
7,0.6796796796796797,0.21910645494291614,679.0,320.0,0.0,0.0,Training stopped progressing
8,0.8378378378378378,0.17477335599628654,837.0,162.0,0.0,0.0,Training stopped progressing
9,0.6506506506506506% ,.22708385517527988,650.0,349.0,0.0,0.0,Training stopped progressing
10,0.8718718718718719% ,.1631510008473296,871.0,128.0,0.0,0.0,Training stopped progressing
11,0.6366366366366366,0.22216476555223819,636.0,363.0,0.0,0.0,Training stopped progressing
12,0.9099099099099099% ,.14630904925746602,909.0,90.0,0.0,0.0,Stopped training early because max_accuracy was reached
13,0.4774774774774775,0.2794152365715893,477.0,522.0,0.0,0.0,Training stopped progressing

    Layer (type)                 Output Shape              Param #   
    =================================================================
    conv2d_1 (Conv2D)            (None, 478, 638, 32)      896       
    _________________________________________________________________
    max_pooling2d_1 (MaxPooling2 (None, 239, 319, 32)      0         
    _________________________________________________________________
    dropout_1 (Dropout)          (None, 239, 319, 32)      0         
    _________________________________________________________________
    conv2d_2 (Conv2D)            (None, 237, 317, 64)      18496     
    _________________________________________________________________
    max_pooling2d_2 (MaxPooling2 (None, 118, 158, 64)      0         
    _________________________________________________________________
    dropout_2 (Dropout)          (None, 118, 158, 64)      0         
    _________________________________________________________________
    conv2d_3 (Conv2D)            (None, 116, 156, 128)     73856     
    _________________________________________________________________
    max_pooling2d_3 (MaxPooling2 (None, 58, 78, 128)       0         
    _________________________________________________________________
    dropout_3 (Dropout)          (None, 58, 78, 128)       0         
    _________________________________________________________________
    flatten_1 (Flatten)          (None, 579072)            0         
    _________________________________________________________________
    dense_1 (Dense)              (None, 256)               148242688 
    _________________________________________________________________
    dropout_4 (Dropout)          (None, 256)               0         
    _________________________________________________________________
    dense_2 (Dense)              (None, 1)                 257       
    =================================================================
    Total params: 148,336,193
    Trainable params: 148,336,193
    Non-trainable params: 0
    _________________________________________________________________

